CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_qspi.c
    /* call the configuration function */
    qspi_config(cmd, QSPI_INDIRECT_WRITE);

    if(cmd->data_mode == QSPI_DATA_NONE){
        /* when there is no data phase, the transfer start as soon as the configuration is done 
        so wait until TC flag is set to go back in idle state */
        while((QSPI_STAT & QSPI_FLAG_TC) == 0U){
        }
        QSPI_STATC = QSPI_STATC_TCC;
    }
}

/*!
    \brief      QSPI transmit data
    \param[in]  tdata: 8-bit data
    \param[out] none
    \retval     none
*/
void qspi_transmit(uint8_t *tdata)
{
    uint32_t TxCounter;
    TxCounter = QSPI_DTLEN + 1U;

    QSPI_TCFG = (QSPI_TCFG & ~QSPI_MEMORY_MAPPED) | QSPI_INDIRECT_WRITE;

    while(TxCounter > 0U){
        while((QSPI_STAT & QSPI_FLAG_FT) == 0U){
        }
        *(uint8_t *)(QSPI + 0x00000020U) = *tdata++;
        TxCounter--;
    }
    while((QSPI_STAT & QSPI_FLAG_TC) == 0U){
    }
    QSPI_STATC = QSPI_STATC_TCC;
}

/*!
    \brief      QSPI receive data
    \param[in]  rdata: empty array
    \param[out] 8-bit data array
    \retval     none
*/
void qspi_receive(uint8_t *rdata)
{
    uint32_t RxCounter, addr;
    RxCounter = QSPI_DTLEN + 1U;
    addr = QSPI_ADDR;

    QSPI_TCFG = (QSPI_TCFG & ~QSPI_MEMORY_MAPPED) | QSPI_INDIRECT_READ;
    /* start the transfer by re-writing the address in ADDR register */
    QSPI_ADDR = addr;

    while(RxCounter > 0U){
        while((QSPI_STAT & (QSPI_FLAG_FT | QSPI_FLAG_TC)) == 0U){
        }
        *rdata++ = *(uint8_t *)(QSPI + 0x00000020U);
        RxCounter--;
    }
    while((QSPI_STAT & QSPI_FLAG_TC) == 0U){
    }
    QSPI_STATC = QSPI_STATC_TCC;
}

/*!
    \brief      configure QSPI autopolling mode
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure 
                             and the member values are shown as below:
                  instruction: reference flash commands description
                  address: 0-flash size
                  alternatebytes: 0-0xFFFFFFFF
                  addresssize: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  alternatebytessize: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS, 
                                      QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  dummycycles: between 0 and 31
                  instructionmode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE, 
                                   QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  addressmode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  alternatebytemode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE, 
                                     QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  datamode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  nbdata: 0-0xFFFFFFFF
                  sioomode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[in]  cfg: autopolling struct initialization stuct members of the structure 
                             and the member values are shown as below:
                  match: between 0 and 0xFFFFFFFF
                  mask: between 0 and 0xFFFFFFFF
                  interval: between 0 and 0xFFFF
                  statusbytessize: between 1 and 4
                  matchmode: QSPI_MATCH_MODE_AND, QSPI_MATCH_MODE_OR
                  automaticstop: QSPI_AUTO_STOP_DISABLE, QSPI_AUTO_STOP_ENABLE
    \param[out] none
    \retval     none
*/
void qspi_autopolling(qspi_command_struct *cmd, qspi_autopolling_struct *cfg)
{
    /* wait till BUSY flag reset */
    while((QSPI_CTL & QSPI_FLAG_BUSY) != 0U){
    }
    QSPI_STATMATCH = cfg->match;
    QSPI_STATMK = cfg->mask;
    QSPI_INTERVAL = cfg->interval;
    QSPI_CTL = (QSPI_CTL & (~(QSPI_CTL_SPS | QSPI_CTL_SPMOD))) | (cfg->match_mode | cfg->auto_stop);
    cmd->data_length = cfg->statusbytes_size;
    qspi_config(cmd, QSPI_AUTO_POLLING);

    while((QSPI_STAT & QSPI_FLAG_SM) == 0U){
    }
    QSPI_STATC = QSPI_STATC_SMC;
}

/*!
    \brief      configure QSPI memorymapped mode
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure 
                             and the member values are shown as below:
                  instruction: reference flash commands description
                  address: 0-flash size
                  alternatebytes: 0-0xFFFFFFFF
                  addresssize: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  alternatebytessize: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS, 
                                      QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  dummycycles: between 0 and 31
                  instructionmode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE, 
                                   QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  addressmode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  alternatebytemode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE, 
                                     QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  datamode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  nbdata: 0-0xFFFFFFFF
                  sioomode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[in]  timeout: 0-0xFFFF
    \param[in]  toen: QSPI_TOEN_DISABLE, QSPI_TOEN_ENABLE
    \param[out] none
    \retval     none
*/
void qspi_memorymapped(qspi_command_struct *cmd, uint16_t timeout, uint32_t toen)
{
    while((QSPI_CTL & QSPI_FLAG_BUSY) != 0U){
    }

    /* configure QSPI: CTL register with timeout counter enable */
    QSPI_CTL = (QSPI_CTL & ~QSPI_CTL_TMOUTEN) | toen;

    if(toen == QSPI_CTL_TMOUTEN){
        /* configure QSPI: TMOUT register with the timeout value */
        QSPI_TMOUT = timeout;
        QSPI_STATC = QSPI_STATC_TMOUTC;
        /* enable the QSPI TimeOut interrupt */
        QSPI_CTL |= QSPI_FLAG_TMOUTIE;
    }
    qspi_config(cmd, QSPI_MEMORY_MAPPED);
}

/*!
    \brief      abort the current transmission. 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_abort(void)
{
    QSPI_CTL |= QSPI_CTL_ABORT;
}

/* if QSPI in FMC mode, use above functions to access secure region. */
/*!
    \brief      QSPI command parameter
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure 
                             and the member values are shown as below:
                  instruction: reference flash commands description
                  address: 0-flash size
                  alternatebytes: 0-0xFFFFFFFF
                  addresssize: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  alternatebytessize: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS, 
                                      QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  dummycycles: between 0 and 31
                  instructionmode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE, 
                                   QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  addressmode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  alternatebytemode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE, 
                                     QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  datamode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  nbdata: 0-0xFFFFFFFF
                  sioomode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[out] none
    \retval     none
*/
void qspi_command_fmc_s(qspi_command_struct* cmd)
{
    while((QSPI_CTL & QSPI_FLAG_BUSY) != 0U){
    }

