CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_qspi.c
            if(cmd->addr_mode != QSPI_ADDR_NONE){
                /* command with instruction, address and alternate bytes */
                /* configure QSPI_TCFG register with all communications parameters */
                QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                            cmd->altebytes_size | cmd->altebytes_mode | 
                            cmd->addr_size | cmd->addr_mode | cmd->instruction_mode | 
                            cmd->instruction | functionalmode;

                if(functionalmode != QSPI_MEMORY_MAPPED ){
                    /* configure QSPI_ADDR register with address value */
                    QSPI_ADDR = cmd->addr;
                }
            }
            else{
                /* command with instruction and alternate bytes */
                /* configure QSPI_TCFG register with all communications parameters */
                QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                            cmd->altebytes_size | cmd->altebytes_mode | 
                            cmd->addr_mode | cmd->instruction_mode | 
                            cmd->instruction | functionalmode;
            }
        }
        else{
            if(cmd->addr_mode != QSPI_ADDR_NONE){
                /* command with instruction and address */
                /* configure QSPI_TCFG register with all communications parameters */
                QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                            cmd->altebytes_mode | cmd->addr_size | cmd->addr_mode | 
                            cmd->instruction_mode | cmd->instruction | functionalmode;

                if(functionalmode != QSPI_MEMORY_MAPPED){
                    /* configure QSPI_ADDR register with address value */
                    QSPI_ADDR = cmd->addr;
                }
            }
            else{
                /* command with only instruction */
                /* configure QSPI_TCFG register with all communications parameters */
                QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                            cmd->altebytes_mode | cmd->addr_mode | cmd->instruction_mode | 
                            cmd->instruction | functionalmode;
            }
        }
    }
    else{
        if(cmd->altebytes_mode != QSPI_ALTE_BYTES_NONE){
            /* configure QSPI_ALTE register with alternate bytes value */
            QSPI_ALTE = cmd->altebytes;

            if(cmd->addr_mode != QSPI_ADDR_NONE){
                /* command with address and alternate bytes */
                /* configure QSPI_TCFG register with all communications parameters */
                QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                            cmd->altebytes_mode | cmd->altebytes_size | cmd->addr_size | 
                            cmd->addr_mode | cmd->instruction_mode | functionalmode;

                if(functionalmode != QSPI_MEMORY_MAPPED){
                    /* configure QSPI_ADDR register with address value */
                    QSPI_ADDR = cmd->addr;
                }
            }
            else{
                /* command with only alternate bytes */
                /* configure QSPI_TCFG register with all communications parameters */
                QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                            cmd->altebytes_mode | cmd->altebytes_size | 
                            cmd->addr_mode | cmd->instruction_mode | functionalmode;
            }
        }
        else{
            if(cmd->addr_mode != QSPI_ADDR_NONE){
                /* command with only address */
                /* configure QSPI_TCFG register with all communications parameters */
                QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                            cmd->altebytes_mode | cmd->addr_size | 
                            cmd->addr_mode | cmd->instruction_mode | functionalmode;
                
                if(functionalmode != QSPI_MEMORY_MAPPED){
                    /* configure QSPI_ADDR register with address value */
                    QSPI_ADDR = cmd->addr;
                }
            }
            else{
                /* command with only data phase */
                if(cmd->data_mode != QSPI_DATA_NONE){
                    /* configure QSPI_TCFG register with all communications parameters */
                    QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                cmd->altebytes_mode | cmd->addr_mode | 
                                cmd->instruction_mode | functionalmode;
                }
            }
        }
    }
}

/*!
    \brief      configure QSPI functionalmode in FMC mode secure register
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure 
                             and the member values are shown as below:
                  instruction: reference flash commands description
                  address: 0-flash size
                  alternatebytes: 0-0xFFFFFFFF
                  addresssize: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  alternatebytessize: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS, 
                                      QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  dummycycles: between 0 and 31
                  instructionmode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE, 
                                   QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  addressmode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  alternatebytemode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE, 
                                     QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  datamode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  nbdata: 0-0xFFFFFFFF
                  sioomode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[in]  functionalmode: QSPI functionalmode select
                only one parameter can be selected which is shown as below:
      \arg        QSPI_INDIRECT_WRITE
      \arg        QSPI_INDIRECT_READ
      \arg        QSPI_AUTO_POLLING
      \arg        QSPI_MEMORY_MAPPED
    \param[out] none
    \retval     none
*/
static void qspi_config_fmc_s(qspi_command_struct* cmd, uint32_t functionalmode)
{
    if((cmd->data_mode != QSPI_DATA_NONE) && (functionalmode != QSPI_MEMORY_MAPPED)){
        /* configure QSPI_DTLEN register with the number of data to read or write */
        QSPI_DTLEN_SEC = cmd->data_length - 1U;
    }

    if(cmd->instruction_mode != QSPI_INSTRUCTION_NONE){
        if(cmd->altebytes_mode != QSPI_ALTE_BYTES_NONE){
            /* configure QSPI_ALTE register with alternate bytes value */
            QSPI_ALTE_SEC = cmd->altebytes;

