CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_qspi.c
            if(cmd->addr_mode != QSPI_ADDR_NONE){
                /* command with instruction, address and alternate bytes */
                /* configure QSPI_TCFG register with all communications parameters */
                QSPI_TCFG_SEC = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                    cmd->altebytes_size | cmd->altebytes_mode | 
                                    cmd->addr_size | cmd->addr_mode | cmd->instruction_mode | 
                                    cmd->instruction | functionalmode;

                if(functionalmode != QSPI_MEMORY_MAPPED ){
                    /* configure QSPI_ADDR register with address value */
                    QSPI_ADDR_SEC = cmd->addr;
                }
            }
            else{
                /* command with instruction and alternate bytes */
                /* configure QSPI_TCFG_SEC register with all communications parameters */
                QSPI_TCFG_SEC = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                    cmd->altebytes_size | cmd->altebytes_mode | 
                                    cmd->addr_mode | cmd->instruction_mode | 
                                    cmd->instruction | functionalmode;
            }
        }
        else{
            if(cmd->addr_mode != QSPI_ADDR_NONE){
                /* command with instruction and address */
                /* configure QSPI_TCFG_SEC register with all communications parameters */
                QSPI_TCFG_SEC = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                    cmd->altebytes_mode | cmd->addr_size | cmd->addr_mode | 
                                    cmd->instruction_mode | cmd->instruction | functionalmode;

                if(functionalmode != QSPI_MEMORY_MAPPED){
                    /* configure QSPI_ADDR_SEC register with address value */
                    QSPI_ADDR_SEC = cmd->addr;
                }
            }
            else{
                /* command with only instruction */
                /* configure QSPI_TCFG_SEC register with all communications parameters */
                QSPI_TCFG_SEC = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                    cmd->altebytes_mode | cmd->addr_mode | cmd->instruction_mode | 
                                    cmd->instruction | functionalmode;
            }
        }
    }
    else{
        if(cmd->altebytes_mode != QSPI_ALTE_BYTES_NONE){
            /* configure QSPI_ALTE_SEC register with alternate bytes value */
            QSPI_ALTE_SEC = cmd->altebytes;            

            if(cmd->addr_mode != QSPI_ADDR_NONE){
                /* command with address and alternate bytes */
                /* configure QSPI_TCFG_SEC register with all communications parameters */
                QSPI_TCFG_SEC = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                    cmd->altebytes_mode | cmd->altebytes_size | cmd->addr_size | 
                                    cmd->addr_mode | cmd->instruction_mode | functionalmode;

                if(functionalmode != QSPI_MEMORY_MAPPED){
                    /* configure QSPI_ADDR_SEC register with address value */
                    QSPI_ADDR_SEC = cmd->addr;                
                }
            }
            else{
                /* command with only alternate bytes */
                /* configure QSPI_TCFG_SEC register with all communications parameters */
                QSPI_TCFG_SEC = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                    cmd->altebytes_mode | cmd->altebytes_size | 
                                    cmd->addr_mode | cmd->instruction_mode | functionalmode;
            }
        }
        else{
            if(cmd->addr_mode != QSPI_ADDR_NONE){
                /* command with only address */
                /* configure QSPI_TCFG_SEC register with all communications parameters */
                QSPI_TCFG_SEC = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                    cmd->altebytes_mode | cmd->addr_size | 
                                    cmd->addr_mode | cmd->instruction_mode | functionalmode;
                
                if(functionalmode != QSPI_MEMORY_MAPPED){
                    /* configure QSPI_ADDR_SEC register with address value */
                    QSPI_ADDR_SEC = cmd->addr;
                }
            }
            else{
                /* command with only data phase */
                if(cmd->data_mode != QSPI_DATA_NONE){
                    /* configure QSPI_TCFG_SEC register with all communications parameters */
                    QSPI_TCFG_SEC = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode | 
                                        cmd->altebytes_mode | cmd->addr_mode | 
                                        cmd->instruction_mode | functionalmode;
                }
            }
        }
    }
}